cleanli2/stm32/src/common.c
  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(BOARD_COM1, USART_FLAG_TC) == RESET)
  {}
  if(ch == '\n')
      USART_SendData(BOARD_COM1, '\r');
  while (USART_GetFlagStatus(BOARD_COM1, USART_FLAG_TC) == RESET);

  return ch;
}

uint16_t __io_getchar()
{
  /* Check the parameters */
  while (USART_GetFlagStatus(BOARD_COM1, USART_FLAG_RXNE) == RESET);
  return 0xff&USART_ReceiveData(BOARD_COM1);
}

int __io_char_received()
{
  return (USART_GetFlagStatus(BOARD_COM1, USART_FLAG_RXNE) == SET);
}

static uint32_t beep_st = 0;
void beep_by_timer_100(uint32_t hz_100)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    //RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);
    //GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    if(beep_st == hz_100){
        return;
    }

    if(hz_100>0){
        /*
        GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN; //TIM_CH1
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  //复用推挽输出
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
        GPIO_ResetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        */

        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
        TIM_DeInit(TIM3);
        TIM_InternalClockConfig(TIM3);
        /* Time base configuration */
        TIM_TimeBaseStructure.TIM_Period = 4000000/hz_100/2;
        TIM_TimeBaseStructure.TIM_Prescaler = 1800;
        TIM_TimeBaseStructure.TIM_ClockDivision = 0;
        TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

        TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

        TIM_ARRPreloadConfig(TIM3, DISABLE);

        TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
        NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&NVIC_InitStructure);

        /* TIM enable counter */
        TIM_Cmd(TIM3, ENABLE);
        beep_st = hz_100;
    }
    else{
        if(beep_st == 0)return;
        beep_st = 0;
        TIM_Cmd(TIM3, DISABLE);
        NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
        NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
        NVIC_Init(&NVIC_InitStructure);
        TIM_ITConfig(TIM3, TIM_IT_Update, DISABLE);
        TIM_DeInit(TIM3);
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, DISABLE);
        /*
        GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
        GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
        GPIO_SetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        */
    }
}

void beep_by_timer(uint32_t hz)
{
    beep_by_timer_100(hz*100);
}

void TIM3_IRQHandler(void)
{
    static int tog=0;
    //if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    if(sound_enable){
        if(tog++&0x1){
            GPIO_SetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        }
        else{
            GPIO_ResetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        }
    }
}

void beep(uint32_t hz, uint32_t t_ms)
{
    uint32_t pd, ct;
    if(hz > 1000000)return;
    if(!sound_enable)return;

    pd = 1000000/hz/2;
    ct = hz*t_ms/1000;
    RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
    GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
    while(ct--){
	    GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
	    delay_us(pd);
	    GPIO_SetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
	    delay_us(pd);
    }
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
}

void mytimer(uint32_t w_seconds)
{
    uint32_t seconds = w_seconds;
    uint32_t t;
    lcd_clr_window(0, 120, 10, 400, 30);
    while(seconds){
        delay_ms(1000);
        seconds--;
        t = (400-120)*(w_seconds-seconds)/w_seconds;
        if(t>0) lcd_clr_window(0xff, 120, 10, t+120, 30);
        lcd_lprintf(430, 10, "%d", seconds);
    }
    lprintf("beep\n");
    beep(1000, 3000);
}

void power_off()
{
    Show_Str(20, 630,RED,0xffff,"Power off in 3 seconds",24,0);
    lprintf_time("power off in 3 secs\n");
    foce_save_log_func();
    beep(600, 100);
#ifndef ALIENTEK_MINI
    check_rtc_alert_and_clear();
    auto_time_alert_set(AUTO_TIME_ALERT_INC_MINS, -1, -1);
    auto_time_correct();
    lprintf_time("gpio setb\n");
    foce_save_log_func();
    GPIO_SetBits(GPIOB,GPIO_Pin_0);
    lprintf_time("gpio setb done\n");
#endif
    delay_ms(200);
    lprintf_time("power off done\n");
    while(1);
}
typedef struct timer_struct
{
    date_info_t start;
    uint32_t seconds_len;
    uint32_t repeat:15;
    uint32_t to_repeat:15;
    uint8_t running:1;
    uint8_t timeout_poff:1;
} timer_struct_t;
timer_struct_t g_timer = {0};

typedef struct progress_indicator
{
    uint32_t x;
    uint32_t y;
    uint32_t w;
    uint32_t h;
    uint16_t f_color;
    uint16_t b_color;
} progress_indicator_t;
progress_indicator_t g_timer_repeat_pi={
    120,
    50,
    260,
    20,
    YELLOW,
    BLACK
};
progress_indicator_t g_timer_pi={
    120,
    10,
    260,
    20,
    YELLOW,
    BLACK
};
void clear_progress_indicator(progress_indicator_t*pip)
{
    lcd_clr_window(WHITE, pip->x, pip->y, pip->x+pip->w, pip->y+pip->h);
}

void w10ms_delay(u32 ct)
{
    u32 x;
    x = g_10ms_count + ct;
    while(x > g_10ms_count)
    {
        //putchars("\nx=");
        //print_hex(x);
    }
}

void update_progress_indicator(progress_indicator_t*pip, uint32_t progressed, uint32_t total)
{
    uint32_t t;
    lcd_clr_window(pip->b_color, pip->x, pip->y, pip->x+pip->w, pip->y+pip->h);
    t = pip->w*progressed/total;
    if(t>0)lcd_clr_window(pip->f_color, pip->x, pip->y, pip->x+t, pip->y+pip->h);
    lcd_lprintf(pip->x+pip->w+5, pip->y, "%d/%d", progressed, total);
}
void my_repeat_timer(uint32_t w_repts, uint32_t seconds)
{
#if 0
    uint32_t repts = w_repts;
    uint32_t t;
    lcd_clr_window(0, 120, 50, 400, 70);
    beep(1000, 3000);
    while(repts){
        mytimer(seconds);
        repts--;
        t = (400-120)*(w_repts-repts)/w_repts;
        if(t>0)lcd_clr_window(0xff, 120, 50, t+120, 70);
        lcd_lprintf(430, 50, "%d", repts);
    }
    power_off();
#endif
    if(g_timer.running){
        g_timer.running = 0;
        clear_progress_indicator(&g_timer_repeat_pi);
        clear_progress_indicator(&g_timer_pi);
        beep(400, 300);
        return;
    }
    g_timer.timeout_poff = 1;
    get_rtc_time(&g_timer.start);
    g_timer.seconds_len = seconds;
    g_timer.running = 1;
    g_timer.repeat = w_repts;
    g_timer.to_repeat = w_repts;
    if(w_repts>1){
        update_progress_indicator(&g_timer_repeat_pi, 0, g_timer.repeat);
    }
    beep(800, 3000);
}
#define AUTO_POWER_OFF_COUNT 100000
//static uint32_t single_timer_len = 16;
/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
u32 task1_stack[STACK_SIZE_LOCAL];
void main_init(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     
  int looptimes = 3;
  //uint32_t ict;
  RCC_ClocksTypeDef RCC_ClocksStatus;

  delay_init();

